tunaSlow/stm32f4_dev_board/f4_lcd_display/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SPEAKER_Pin GPIO_PIN_13
#define SPEAKER_GPIO_Port GPIOC
#define BEEP1_Pin GPIO_PIN_7
#define BEEP1_GPIO_Port GPIOA
#define LED4_Pin GPIO_PIN_1
#define LED4_GPIO_Port GPIOB
#define KEY1_Pin GPIO_PIN_12
#define KEY1_GPIO_Port GPIOF
#define KEY2_Pin GPIO_PIN_13
#define KEY2_GPIO_Port GPIOF
#define KEY3_Pin GPIO_PIN_14
#define KEY3_GPIO_Port GPIOF
#define KEY4_Pin GPIO_PIN_15
#define KEY4_GPIO_Port GPIOF
#define RELAY1_Pin GPIO_PIN_0
#define RELAY1_GPIO_Port GPIOG
#define RELAY2_Pin GPIO_PIN_1
#define RELAY2_GPIO_Port GPIOG
#define LED1_Pin GPIO_PIN_2
#define LED1_GPIO_Port GPIOG
#define LED2_Pin GPIO_PIN_3
#define LED2_GPIO_Port GPIOG
#define LED3_Pin GPIO_PIN_4
#define LED3_GPIO_Port GPIOG
#define TOUCH_INT_Pin GPIO_PIN_13
#define TOUCH_INT_GPIO_Port GPIOG
#define TOUCH_INT_EXTI_IRQn EXTI15_10_IRQn
#define TOUTH_RST_Pin GPIO_PIN_15
#define TOUTH_RST_GPIO_Port GPIOG
#define LCD_BL_Pin GPIO_PIN_5
#define LCD_BL_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
